from py2neo import Graph

graph = Graph("bolt://localhost:7687", auth=("neo4j", "neo4j"))

CA_LIST = {
        "农具":0,"整地农具":1,"播种农具":2,"中耕农具":3,"灌溉农具":4,"收获农具":5,"运输农具":6,"加工农具":7,"称量农具":8,"其他农具":9,
        "农书":0,"综合类":1,"种植类":2,"畜牧类":3,"农具类":4,"水利类":5,"蚕桑类":6,"茶叶类":7,"治蝗类":8,"其他农书":9,
        "食疗类":9,"渔业类":9,"气象类":9,"园艺类":9,"林业类":9,"药材类":9,"食品加工类":9,"边疆农业类":9,"农业经济类":9,"农业哲学类":9,
        "农作物":0,"谷类作物":1,"豆类植物":2,"薯类作物":3,"油料作物":4,"蔬菜作物":5,"果类":6,"饲料作物":7,"药用作物":8,"其他作物":9,
        "农业技术":0,"耕作技术":1,"山地水利":2,"发酵技术":3,"种植技术":4,"存储技术":5,"加工技术":6,"育种技术":7,"土壤改良技术":8,"防灾技术":9,
        "农业文化":0, "生态智慧":1, "水利工程":2, "农业系统":3,"丝绸之路":4,"特色林果":5,"农耕民俗":6,"农业经济":7,"古训":8,"其他文化":9,
    }


similar_words = {
    "包括" : "包括",
}